# 출력 (화면의 보여주기)
print("안녕하세요")

# 변수 (저장공간)
# 변수 생성(선언)
변수이름 = "반갑습니다"

# 변수 사용
print(변수이름)
print("안녕하세요", 변수이름)
print("안녕하세요 {}".format(변수이름))

# 입력 input
# 변수 = input('안내할 내용')
입력 = input("입력하세요 >>> ")

# 입력한 값을 출력
print("입력한 값은", 입력)

# 사칙연산
숫자1 = 100
숫자2 = 50

더하기 = 숫자1 + 숫자2
빼기 = 숫자1 - 숫자2
곱하기 = 숫자1 * 숫자2
나누기 = 숫자1 / 숫자2

print(숫자1, "+", 숫자2, "=", 더하기)       # 150
print(숫자1, "-", 숫자2, "=", 빼기)         # 50
print(숫자1, "*", 숫자2, "=", 곱하기)       # 5000
print(숫자1, "/", 숫자2, "=", 나누기)       # 2.0

